1_repuslive-ball-overset/case/twodisks/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

xlength #eval{(8*$scale)};
ylength #eval{(4*$scale)};
zlength #eval{(0.2*$scale)};
scalex 0.35;
scaley 0.35;
centerLx #eval{ (-$scalex*$xlength) };
centerLy #eval{ -$scaley*$ylength };
centerLz #eval{ -0.5*$zlength };

centerRx #eval{ ($scalex*$xlength) };
centerRy #eval{ -$scaley*$ylength };
centerRz #eval{ -0.5*$zlength };

criticalDist #eval{(0.5*$ylength)};

dynamicFvMesh dynamicOversetFvMesh;

solver twoCondSixDoFDynamicMotionSolver;

twoCondSixDoFDynamicMotionSolverCoeffs
{
    movingZone1
    {
	//- start 6 dof
        //solidBodyMotionFunction sixDoFDynamicMotion;
	criticalDist    $criticalDist;
	repulsiveForce  1.0;
        patches         (hole);
	g               (0 -1e-1 0); 
        centreOfMass    ($centerLx $centerLy 0);
        //centreOfMass    (0 0 0);
        mass            0.155;
        momentOfInertia ( 7.6e-5 7.6e-5 7.6e-5);
        velocity        ( 1.0 1.0 0 );
        rho             rhoInf;
        solver
        {
            type            CrankNicolson;
        }
        constraints
        {
            twoDmotionOnly
            {
                sixDoFRigidBodyMotionConstraint   plane;
                normal                            (0 0 1);
            }

            noRotation
            {
            	sixDoFRigidBodyMotionConstraint   axis;
            	axis                              (0 0 1);
            }

        }
        restraints
        {
        }
	//- end 6 dof
    }

    movingZone2
    {
	//- start 6 dof
        //solidBodyMotionFunction sixDoFDynamicMotion;
	criticalDist    $criticalDist;
	repulsiveForce  1.0;
        patches         (hole1);
	g               (0 -1e-1 0); 
        centreOfMass    ($centerRx $centerRy 0);
        //centreOfMass    (0 0 0);
        mass            0.155;
        momentOfInertia ( 7.6e-5 7.6e-5 7.6e-5);
        velocity        ( -1.0 1.0 0 );
        rho             rhoInf;
        solver
        {
            type            CrankNicolson;
        }
        constraints
        {
            twoDmotionOnly
            {
                sixDoFRigidBodyMotionConstraint   plane;
                normal                            (0 0 1);
            }

            noRotation
            {
            	sixDoFRigidBodyMotionConstraint   axis;
            	axis                              (0 0 1);
            }

        }
        restraints
        {
        }
	//- end 6 dof
    }
}


// ************************************************************************* //
